################
#     Taps     #
################
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "olets/tap"

################
#     Brew     #
################
brew "awscli"           # Official Amazon AWS command-line interface
brew "azure-cli"        # Official Azure command-line interface
brew "fdupes"           # Identify or delete duplicate files
brew "git"              # Distributed revision control system
brew "glances"          # Alternative to top/htop
brew "mas"              # Mac App Store command-line interface
brew "nvm"              # Node Version Manager -- manage node versions
brew "pv"               # Pipe Viewer -- Monitor data's progress through a pipe
brew "pyenv"            # Python version management
brew "pyenv-virtualenv" # Pyenv plugin to manage virtualenv
brew "tcptraceroute"    # Traceroute implementation using TCP packets
brew "thefuck"          # Programatically correct mistyped console commands
brew "watch"            # Executes a program periodically, showing output fullscreen
brew "wget"             # Internet file retriever
brew "olets/tap/zsh-window-title" # Fix the window title

################
#    Casks     #
################
cask "1password"
cask "affinity-designer"
cask "affinity-photo"
cask "alfred"
cask "bruno"
cask "cron"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "loom"
cask "messenger"
cask "notion"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "warp"

################
#     Mas      #
################
mas "Bear", id: 1091189122
mas "Things", id: 904280696
