################
#     Taps     #
################
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

################
#     Brew     #
################
brew "awscli"           # Official Amazon AWS command-line interface
brew "bash-completion"  # Programmable completion for Bash 3.2
brew "fdupes"           # Identify or delete duplicate files
brew "git"              # Distributed revision control system
brew "glances"          # Alternative to top/htop
brew "mas"              # Mac App Store command-line interface
brew "nvm"              # Manage multiple Node.js versions
brew "pv"               # Monitor data's progress through a pipe
brew "pyenv"            # Python version management
brew "pyenv-virtualenv" # Pyenv plugin to manage virtualenv
brew "tcptraceroute"    # Traceroute implementation using TCP packets
brew "thefuck"          # Programatically correct mistyped console commands
brew "watch"            # Executes a program periodically, showing output fullscreen
brew "wget"             # Internet file retriever

################
#    Casks     #
################
cask "1password"
cask "alfred"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "spotify"
cask "tableplus"
cask "typora"
cask "visual-studio-code"
cask "zoomus"

################
#     Mas      #
################
mas "Pages", id: 409201541
